Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Using a count with "r" causes that many characters to be replaced with the same character.
es_es: Usar un multiplicador con «r» causa que se reemplacen muchos caracteres con el mismo carácter.

source: To replace a character with a line break use "r<Enter>".
es_es: Para reemplazar un carácter con un salto de línea use «r<Entrar>».

source: This deletes one character and inserts a line break.
es_es: Esto elimina un carácter e inserta un salto.

source: Using a count here only applies to the number of characters deleted: "4r<Enter>" replaces four characters with one line break.
es_es: Usar un multiplicador aquí sólo afecta al número de caracteres eliminados: «4r<Entrar>» reemplaza cuatro caracteres con un salto.

source: The "." command is one of the most simple yet powerful commands in Vim.
es_es: La orden «.» es uno de los más sencillos pero más potentes de Vim.

source: It repeats the last change.
es_es: Repite el último cambio.

source: For instance, suppose you are editing an HTML file and want to delete all the <B> tags.
es_es: Por ejemplo, suponga que está editando un archivo HTML y desea eliminar todas las etiquetas <B>.

source: You position the cursor on the first < and delete the <B> with the command "df>".
es_es: Para ello, coloque el cursor sobre el primer < y luego elimine el <B> con la orden «df>».

source: You then go to the < of the next </B> and kill it using the "." command.
es_es: Entonces va al < del </B> y lo elimina con la orden «.».

source: The "." command executes the last change command (in this case, "df>").
es_es: La orden «.» ejecuta el último cambio (en este caso «df>»).

source: To delete another tag, position the cursor on the < and use the "." command.
es_es: Para eliminar otra etiqueta, coloque el cursor sobre el < y vuelve a pulsar la orden «.».

source: To <B>generate</B> a table of <B>contents ~ f< find first < ---> df> delete to > --> f< find next < ---------> .
es_es: Para <B>generar</B> una tabla de <B>contenidos ~ f< ir al primer < ---> df> elimina hasta > --> f< ir al segundo < ----------> .

source: repeat df> ---> f< find next < -------------> .
es_es: repetir df> ---> f< ir al siguiente < ------------------> .

source: repeat df> -->
es_es: repetir df> -->

source: Another example: You want to change the word "four" to "five".
es_es: Otro ejemplo: Desea cambiar la palabra «cuatro» por «cinco».

source: It appears several times in your text.
es_es: Aparece varias veces en su texto.

source: You can do this quickly with this sequence of commands:
es_es: Puede hacer esto rápidamente en una secuencia de órdenes:

source: /four<Enter> find the first string "four" cwfive<Esc> change the word to "five" n find the next "four" .
es_es: /cuatro<Entrar> encuentra la primera cadena «cuatro» cwcinco<Esc> cambia la palabra a «cinco» n encuentra la siguiente cadena «cuatro» .

source: repeat the change to "five' n find the next "four" .
es_es: repite el cambio a «cinco» n encuentra la siguiente cadena «cuatro» .

source: repeat the change etc.
es_es: repite el cambio etc.

source: To delete simple items the operator-motion changes work quite well.
es_es: Los cambios operador-movimiento funcionan bastante bien para eliminar elementos sencillos.

source: But often it's not so easy to decide which command will move over the text you want to change.
es_es: Pero a menudo, no es fácil decidir que orden de movimiento le desplazará hasta el texto que quiere modificar.

source: Then you can use Visual mode.
es_es: Es el momento de usar el modo Visual.

source: You start Visual mode by pressing "v".
es_es: Puede iniciar el modo Visual pulsando «v».

source: You move the cursor over the text you want to work on.
es_es: Puede mover el cursor sobre el texto que desea modificar.

source: While you do this, the text is highlighted.
es_es: Mientras haces esto, el texto se resalta.

source: Finally type the operator command.
es_es: Finalmente, teclee la orden del operador.

source: For example, to delete from halfway one word to halfway another word:
es_es: Por ejemplo, para eliminar de la mitad de una palabra a la mitad de otra:

source: When doing this you don't really have to count how many times you have to press "l" to end up in the right position.
es_es: Cuando hace esto, no tiene que contar cuántas veces pulsa «e» o «h» para llegar a la posición deseada.

source: You can immediately see what text will be deleted when you press "d".
es_es: Puede verlo de forma inmediata antes de pulsar «d».

source: If you want to work on whole lines, use "V" to start Visual mode.
es_es: Si quiere trabajar con líneas completas, use «V» para iniciar el modo Visual.

source: You will see right away that the whole line is highlighted, without moving around.
es_es: Verá que toda la línea se resalta, sin ni siquiera mover el cursor.

source: When you move left or right nothing changes.
es_es: Cuando mueva el cursor a la izquierda o derecha, nada cambiará.

source: When you move up or down the selection is extended whole lines at a time.
es_es: Si lo mueve hacia arriba o hacia abajo, la selección se extenderá a líneas completas.

source: For example, select three lines with "Vjj":
es_es: Por ejemplo, seleccione tres líneas con «Vjj»:

source: If you want to work on a rectangular block of characters, use CTRL-V to start Visual mode.
es_es: Si desea trabajar en un bloque rectangular de caracteres, use CTRL-V para iniciar el modo Visual.

source: This is very useful when working on tables.
es_es: Esto es muy útil si trabaja con tablas.

source: To delete the middle "Q2" column, move the cursor to the "Q" of "Q2".
es_es: Para eliminar la columna central «Q2» desplaze el cursor a la «Q» de «Q2».

source: Press CTRL-V to start blockwise Visual mode.
es_es: Pulse CTRL-V para iniciar el modo Visual de bloques.

source: Now move the cursor three lines down with "3j" and to the next word with "w".
es_es: Ahora mueva el cursor tres líneas abajo con «3j» y a la siguiente palabra con «w».

source: You can see the first character of the last column is included.
es_es: Puede comprobar que el primer carácter de la última columna se ha incluido.

source: To exclude it, use "h".
es_es: Para excluirlo, use «h».

source: Now press "d" and the middle column is gone.
es_es: Si ahora pulsa «d» la columna central desaparecerá.

source: If you have selected some text in Visual mode, and discover that you need to change the other end of the selection, use the "o" command (Hint: o for other end).
es_es: Si ha seleccionado algo de texto en modo Visual, y descubre que necesita cambiar el otro lado de la selección, use la orden «o» (Truco: o para el «otro» lado).

source: The cursor will go to the other end, and you can move the cursor to change where the selection starts.
es_es: El cursor irá hasta el otro final de la selección, y podrá modificar dónde comienza la selección.

source: Pressing "o" again brings you back to the other end.
es_es: Pulsa «o» de nuevo para volver al otro lado.

source: When using blockwise selection, you have four corners.
es_es: Cuando usa el modo Visual de bloques, tiene cuatro esquinas.

source: "o" only takes you to one of the other corners, diagonally.
es_es: «o» le llevará a una de las otras líneas diagonalmente.

source: Use "O" to move to the other corner in the same line.
es_es: Use «O» para moverse hacia el otro final de la misma línea.

source: When you delete something with the "d", "x", or another command, the text is saved.
es_es: Cuando elimina algo con «d», «x», u otra orden, el texto se guarda.

source: You can paste it back by using the p command.
es_es: Puede pegarlo usando la orden «p».

source: (The Vim name for this is put).
es_es: (El nombre de Vim para esto es «poner», del inglés «put»).

source: Take a look at how this works.
es_es: Échale un vistazo a cómo funciona esto.

source: First you will delete an entire line, by putting the cursor on the line you want to delete and typing "dd".
es_es: Elimine primero una línea completa poniendo el cursor en la línea y pulsando «dd».

source: Now you move the cursor to where you want to put the line and use the "p" (put) command.
es_es: Mueva ahora el cursor allá donde quiera poner la línea y use la orden «p».

source: The line is inserted on the line below the cursor.
es_es: La línea se insertará en la línea siguiente a donde se encuentra el cursor.

source: Because you deleted an entire line, the "p" command placed the text line below the cursor.
es_es: Ya que eliminó una línea completa, la orden «p» colocó la línea de texto debajo del cursor.

source: If you delete part of a line (a word, for instance), the "p" command puts it just after the cursor.
es_es: Si elimina parte de una línea (una palabra, por ejemplo), la orden «px la pone justo después del cursor.

source: The "P" command puts text like "p", but before the cursor.
es_es: La orden «P» pone una línea como «p», pero antes del cursor.

source: When you deleted a whole line with "dd", "P" will put it back above the cursor.
es_es: Cuando elimine una línea con «dd», «P» lo pondrá de vuelta sobre el cursor.

source: When you deleted a word with "dw", "P" will put it back just before the cursor.
es_es: Cuando elimine una palabra con «dw», «P» lo pondrá antes del cursor.

source: You can repeat putting as many times as you like.
es_es: Puede repetir la orden tantas veces como quiera.

source: The same text will be used.
es_es: Se usará el mismo texto.

source: You can use a count with "p" and "P".
es_es: Puede usar un multiplicador con «p» y «P».

source: The text will be repeated as many times as specified with the count.
es_es: El texto se repetirá tantas veces como especifique con el multiplicador.

source: Thus "dd" and then "3p" puts three copies of the same deleted line.
es_es: Por ejemplo, usar «dd» y luego «3p» pone tres copias de la misma línea eliminada.

source: Frequently when you are typing, your fingers get ahead of your brain (or the other way around?).
es_es: Más de una vez, mientras teclea, sus dedos irán por delante de su cerebro (¿o al revés?).

source: The result is a typo such as "teh" for "the".
es_es: El resultado es un error del tipo «uqe» en lugar de «que».

source: Vim makes it easy to correct such problems.
es_es: Vim hace que corregir estos problemas sea sencillo.

source: Just put the cursor on the e of "teh" and execute the command "xp".
es_es: Simplemente ponga el cursor sobre la «u» de «uqe» y ejecute la orden «xp».

source: This works as follows: "x" deletes the character e and places it in a register.
es_es: Esto funciona del siguiente modo: «x» elimina el carácter «u» y lo coloca en un registro.

source: "p" puts the text after the cursor, which is after the h.
es_es: «p» pone el texto después del cursor, justo después de la «q».

source: To copy text from one place to another, you could delete it, use "u" to undo the deletion and then "p" to put it somewhere else.
es_es: Para copiar texto de un lugar a otro, puede eliminarlo, usar «u» para deshacer la eliminación y después usar «p» para colocarlo en otro lugar.

source: There is an easier way: yanking.
es_es: Hay un modo mejor: «yank» (dar un tirón).

source: The "y" operator copies text into a register.
es_es: El operador «y» copia texto en un registro.

source: Then a "p" command can be used to put it.
es_es: Puede usar una orden «p» para ponerlo.

source: Yanking is just a Vim name for copying.
es_es: «Yanking» es simplemente el nombre de Vim para copiar.

source: The "c" letter was already used for the change operator, and "y" was still available.
es_es: La letra «c» ya estaba en uso por el operador «cambiar», y la «y» estaba aún disponible.

source: Calling this operator "yank" made it easier to remember to use the "y" key.
es_es: Llamar a este el operador «yank» hizo que fuera más fácil recordar la «y».

source: Since "y" is an operator, you use "yw" to yank a word.
es_es: Ya que «y» es un operador, se usa «yw» para copiar una palabra.

source: A count is possible as usual.
es_es: Se puede usar un multiplicador.

source: To yank two words use "y2w".
es_es: Para copiar dos palabras usa «y2w».

source: Notice that "yw" includes the white space after a word.
es_es: Observe que «yw» incluye el espacio en blanco después de la palabra.

source: If you don't want this, use "ye".
es_es: Si no quiere que esto ocurra, us «ye».

source: The "yy" command yanks a whole line, just like "dd" deletes a whole line.
es_es: La orden «yy» copia una sola línea, al igual que «dd» la elimina.

source: Unexpectedly, while "D" deletes from the cursor to the end of the line, "Y" works like "yy", it yanks the whole line.
es_es: Sin embargo, mientras que «D» elimina desde el cursor hasta el final de la línea, «Y» funciona como «yy», copiando la línea completa.

source: Watch out for this inconsistency!
es_es: ¡Cuidado con esta inconsistencia!

source: Use "y$" to yank to the end of the line.
es_es: Use «y$» para copiar sólo hasta el final.

source: If you have copied text to the clipboard in another application, you can paste it in Vim with the Edit/Paste menu.
es_es: Si ha copiado texto en el portapapeles desde otra aplicación, puede pegarlo en Vim con el menú Editar/Pegar.

source: This works in Normal mode and Insert mode.
es_es: Esto funciona en modo Normal y en modo Insertar.

source: In Visual mode the selected text is replaced with the pasted text.
es_es: En modo Visual el texto seleccionado es reemplazado.

source: The "Cut" menu item deletes the text before it's put on the clipboard.
es_es: La opción «Cortar» del menú elimina el texto antes de ponerlo en el portapapeles.

source: The "Copy", "Cut" and "Paste" items are also available in the popup menu (only when there is a popup menu, of course).
es_es: Las opciones «Cortar», «Copiar» y «Pegar» están también disponibles en el menú contextual (sólo cuando esté disponible).

source: If your Vim has a toolbar, you can also find these items there.
es_es: Si su Vim tiene barra de tareas, puede encontrar estos botones allí también.

source: If you are not using the GUI, or if you don't like using a menu, you have to use another way.
es_es: Si no usa la GUI o no te gusta usar el menú, tiene otro modo.

source: You use the normal "y" (yank) and "p" (put) commands, but prepend "* (double-quote star) before it.
es_es: Use la orden «y» normal (copiar) y «p» (poner), pero antes escriba «"*» (comillas dobles, asterisco).

source: To copy a line to the clipboard: >
es_es: Para copiar una línea en el portapapeles: >

source: This only works on versions of Vim that include clipboard support.
es_es: Esto sólo funciona en versiones de Vim que incluyen soporte para portapapeles.

source: More about the clipboard in section |09.3| and here: |clipboard|.
es_es: Más sobre el portapapeles en la sección |09.3| y aquí: |clipboard|.

source: If the cursor is in the middle of a word and you want to delete that word, you need to move back to its start before you can do "dw".
es_es: Si el cursor está en medio de una palabra y la quiere eliminar, tiene que desplazarse hasta su comienzo antes de que pueda hacer «dw».

source: There is a simpler way to do this: "daw".
es_es: Hay un modo más sencillo de hacer esto: «daw».

source: this is some example text.
es_es: esto es texto de ejemplo.

source: this is some text.
es_es: esto es de ejemplo.

source: The "d" of "daw" is the delete operator.
es_es: La «d» de «daw» es el operador de eliminación.

source: "aw" is a text object.
es_es: «aw» es el objeto de texto.

source: Hint: "aw" stands for "A Word".
es_es: Truco: «aw» viene de «A Word».

source: Thus "daw" is "Delete A Word".
es_es: Por lo que «daw» es «Delete A Word».

source: To be precise, the white space after the word is also deleted (the white space before the word at the end of the line).
es_es: Para ser más precisos, el espacio después de la palabra se elimina también (el espacio antes de la palabra si ésta se encuentra al final de una línea).

source: To change a whole sentence use "cis".
es_es: Para cambiar una oración completa use «cis».

source: Take this text:
es_es: Suponga este texto:

source: This ~ is an example.
es_es: Esto ~ es un ejemplo.

source: Move to the start of the second line, on "is an".
es_es: Vaya al comienzo de la segunda línea, sobre el «es un».

source: Now use "cis":
es_es: Ahora, use «cis»:

source: The cursor is in between the blanks in the first line.
es_es: El cursor está entre los espacios de la primera línea.

source: Now you type the new sentence "Another line.":
es_es: Escriba ahora la nueva frase «Otra línea.»:

source: Another line.
es_es: Otra línea.

source: "cis" consists of the "c" (change) operator and the "is" text object.
es_es: «cis» consiste del operador «c» (cambiar) y el objeto de texto «is».

source: This stands for "Inner Sentence".
es_es: Esto viene de «Inner Sentence».

source: There is also the "as" (a sentence) object.
es_es: También hay un objeto «as» (a sentence).

source: The difference is that "as" includes the white space after the sentence and "is" doesn't.
es_es: La diferencia es que «as» incluye el espacio en blanco después de la frase e «is» no.

source: If you would delete a sentence, you want to delete the white space at the same time, thus use "das".
es_es: Si desea eliminar la frase y quiere eliminar al mismo tiempo el espacio en blanco posterior, use entonces «das».

source: If you want to type new text the white space can remain, thus you use "cis".
es_es: Si quiere escribir otro texto, el espacio puede permanecer, con lo que puedes usar «cis».

source: You can also use text objects in Visual mode.
es_es: También puede usar los objetos de texto on modo Visual.

source: It will include the text object in the Visual selection.
es_es: Incluirá el objeto de texto en la selección.

source: Visual mode continues, thus you can do this several times.
es_es: El modo Visual permanece, así que puede hacerlo varias veces.

source: For example, start Visual mode with "v" and select a sentence with "as".
es_es: Por ejemplo, inicie el modo Visual con «v» y seleccione una frase con «as».

source: Now you can repeat "as" to include more sentences.
es_es: Ahora puede repetir «as» para incluir más frases.

source: Finally you use an operator to do something with the selected sentences.
es_es: Por último, use un operador para hacer algo con las frases seleccionadas.

source: The "R" command causes Vim to enter replace mode.
es_es: La orden «R» hace que Vim entre en modo reemplazar.

source: In this mode, each character you type replaces the one under the cursor.
es_es: En este modo, cada carácter que introduzca reemplaza al que está debajo del cursor.

source: This continues until you type <Esc>.
es_es: Esto continúa hasta que pulse <Esc>.

source: In this example you start Replace mode on the first "t" of "text":
es_es: En este ejemplo, Ud. comienza el modo Reemplazar en la primera «t» de «texto»:

source: This is text.
es_es: Esto es texto.

source: ~ Rinteresting.<Esc>
es_es: ~ Rinteresante.<Esc>

source: This is interesting.
es_es: Esto es interesante.

source: You may have noticed that this command replaced 5 characters in the line with twelve others.
es_es: Puede que haya notado que ha reemplazado 5 caracteres en la línea con otros doce.

source: The "R" command automatically extends the line if it runs out of characters to replace.
es_es: La orden «R» extiende automáticamente la línea si se queda sin caracteres que reemplazar.

source: It will not continue on the next line.
es_es: Esto no ocurrirá en la siguiente línea.

source: When you use <BS> (backspace) to make correction, you will notice that the old text is put back.
es_es: Cuando use <Retroceso> para hacer una corrección comprobará que el texto anterior reaparece.

source: Thus it works like an undo command for the last typed character.
es_es: Por lo tanto, funciona como la orden deshacer para el último carácter tecleado.

source: The operators, movement commands and text objects give you the possibility to make lots of combinations.
es_es: Los operadores, órdenes de movimiento y los objetos de texto le dan múltiples posibilidades para hacer muchas combinaciones.

source: Now that you know how it works, you can use N operators with M movement commands to make N * M commands!
es_es: Ahora que sabe cómo funciona, puede usar N operadores con M órdenes de movimiento para hacer M * N órdenes!

source: For example, there are many other ways to delete pieces of text.
es_es: Por ejemplo, hay otras muchas maneras de eliminar porciones de texto.

source: Here are a few often used ones:
es_es: Aquí tiene algunas de las más empleadas:

source: If you use "c" instead of "d" they become change commands.
es_es: Si usa «c» en lugar de «d»,estos se convierten en órdenes de cambio.

source: And with "y" you yank the text.
es_es: Y con «y» copias el texto.

source: And so forth.
es_es: Y así en adelante.

source: ~ change case of the character under the cursor, and move the cursor to the next character.
es_es: ~ cambia el carácter bajo el cursor de minúsculas a mayúsculas y al revés, moviéndose al siguiente carácter.

source: This is not an operator (unless 'tildeop' is set), thus you can't use it with a motion command.
es_es: No es un operador (a menos que 'tildeop' esté activado), por lo que no lo puede usar con un movimiento.

source: It does work in Visual mode and changes case for all the selected text then.
es_es: Sí funciona en modo Visual y cambia todo lo que está seleccionado.

source: *usr_03.txt* For Vim version 7.3.
es_es: *usr_03.esx* Para Vim version 7.3.

source: Before you can insert or delete text the cursor has to be moved to the right place.
es_es: Antes de que pueda insertar o eliminar texto, el cursor tiene que desplazarse al lugar adecuado.

source: Vim has a large number of commands to position the cursor.
es_es: Vim tiene una gran cantidad de órdenes para situar el cursor.

source: This chapter shows you how to use the most important ones.
es_es: Este capítulo muestra cómo usar los más importantes.

source: You can find a list of these commands below |Q_lr|.
es_es: Puede encontrar una lista de estas órdenes a continuación |Q_lr|.

source: To move the cursor forward one word, use the "w" command.
es_es: Para mover el cursor una palabra hacia delante, use la orden «w».

source: Like most Vim commands, you can use a numeric prefix to move past multiple words.
es_es: Del mismo modo que la mayoría de órdenes Vim, puede usar un prefijo numérico.

source: For example, "3w" moves three words.
es_es: Por ejemplos, «3w» se mueve tres palabras.

source: This figure shows how it works:
es_es: Esta figura muestra cómo funciona:

source: Notice that "w" moves to the start of the next word if it already is at the start of a word.
es_es: Fíjese en que «w» le mueve al comienzo de la siguiente palabra si ya se encuentra al comienzo de una palabra.

source: The "b" command moves backward to the start of the previous word:
es_es: La orden «b» le desplaza al comienzo de la palabra anterior:

source: A word ends at a non-word character, such as a ".", "-" or ")".
es_es: Una palabra termina en un carácter de separación, como «.», «-» o «)».

source: To change what Vim considers to be a word, see the 'iskeyword' option.
es_es: Para cambiar lo que Vim considera una palabra, consulte la opción 'iskeyword'.

source: It is also possible to move by white-space separated WORDs.
es_es: También es posible desplazarse por palabras separadas por espacios en blanco.

source: This is not a word in the normal sense, that's why the uppercase is used.
es_es: Esto no es una PALABRA en el sentido habitual, por ello se usan las mayúsculas para designarla.
